{
  "backend/main.mo": "Defines the main actor and all core game types plus state maps for profiles, combat, clans, events, and dungeons.",
  "backend/migration.mo": "Provides data types matching old and new actor structures and logic for migrating stored state between versions.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend source files to help with build planning and tracking.",
  "frontend/index.css": "Defines global Tailwind CSS variables and dark theme color tokens for the frontend.",
  "frontend/index.html": "Basic HTML bootstrap file loading the React app entry script.",
  "frontend/src/App.tsx": "Main React component handling authentication gating, routing between pages, and profile setup flow.",
  "frontend/src/components/AuthGate.tsx": "Handles login/logout via Internet Identity and guards the app until authentication completes.",
  "frontend/src/components/GameLayout.tsx": "Defines the main game layout with navigation, header, logout handling, and dynamic admin menu entry.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Provides a dialog for creating a new player profile with a create button and loading state.",
  "frontend/src/components/ProgressionPanel.tsx": "Renders a survivor’s level, experience progress, and core stats using styled UI components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating player profiles, survivors, and related game data via the actor.",
  "frontend/src/index.css": "Defines Tailwind CSS setup and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface allowing admins to grant currency, unlock killers, set levels, add weapons or pets, and create admin events.",
  "frontend/src/pages/ClansPage.tsx": "Displays clan marketplace and join listings, with features to create listings, form clans, and join or randomly join clans.",
  "frontend/src/pages/DungeonPage.tsx": "Shows available dungeons, lets players start and complete quests, unlock crates, and view rewards.",
  "frontend/src/pages/GameplayPage.tsx": "Handles enemy combat flow, including starting fights, performing attacks, and managing combat state.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard summarizing player status and linking to survivors, combat, inventory, killers, shop, and admin pages.",
  "frontend/src/pages/InventoryPage.tsx": "Displays the user's weapons and pets, allowing equipping items and showing stats, with loading and empty states.",
  "frontend/src/pages/KillersPage.tsx": "Shows the list of killers, their stats, and unlock status, and allows unlocking the next killer in sequence.",
  "frontend/src/pages/ShopPage.tsx": "Displays purchasable upgrades, notably the Admin Panel, showing cost, affordability, and purchase actions or alerts.",
  "frontend/src/pages/SocialPage.tsx": "Provides UI for following and unfollowing users via Principal IDs and displays followers, following, and friends lists.",
  "frontend/src/pages/SurvivorsPage.tsx": "Manages survivor characters, enabling creation with custom stats and selecting an active survivor.",
  "frontend/src/pages/UpdatesPage.tsx": "React page that displays a list of game update entries with titles, versions, dates, descriptions, and feature lists using UI card components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color variables, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing game features, architecture notes, progression systems, social features, and existing requirement-linked feature implementations."
}