{
  "backend/main.mo": "Defines the main game canister with data types for players, combat, clans, dungeons, and storage maps, integrating migrations and authorization mixins.",
  "backend/migration.mo": "Contains legacy type definitions and structures needed for migrating older stored data to the current backend format.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test cases.",
  "frontend-file-summaries.txt": "Provides short descriptions of key frontend files for documentation and build planning.",
  "frontend/index.css": "Defines global Tailwind-based CSS variables and theme settings for light and dark modes.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, page routing, layout rendering, and profile setup gating.",
  "frontend/src/components/AuthGate.tsx": "Handles Internet Identity login flow and shows a login card until authenticated, then renders children.",
  "frontend/src/components/GameLayout.tsx": "Provides the main game UI layout with header, navigation bar, user info, and logout handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Displays a profile setup form allowing players to create a profile and set a username, with optional advanced principal info.",
  "frontend/src/components/ProgressionPanel.tsx": "Shows a survivor’s level, experience progress, and key stats in a styled panel.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider to manage login state, identity loading, and authentication actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile data and other game-related backend interactions.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light and dark theme CSS variables for colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface allowing currency grants, killer unlocks, level changes, item additions, and event creation.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Displays announcements and allows admins to create new ones with title and message inputs.",
  "frontend/src/pages/AuraClickerPage.tsx": "Implements the Aura Clicker game with aura power clicking, leveling, rebirth logic, and progress display.",
  "frontend/src/pages/ClansPage.tsx": "Shows clan marketplace, join listings, and provides UI for creating listings, creating clans, and joining clans.",
  "frontend/src/pages/DungeonPage.tsx": "Displays dungeons and quests, allowing quest start/complete actions and crate unlocking with reward display.",
  "frontend/src/pages/GameplayPage.tsx": "Implements the gameplay UI, handling enemy and bot combat using query hooks, state for fights, and predefined enemy/boss stats.",
  "frontend/src/pages/HomePage.tsx": "Displays a welcome screen with navigation to core gameplay sections and shows basic user profile status like survivors and killers.",
  "frontend/src/pages/InventoryPage.tsx": "Shows the user's weapons and pets, allowing equipping items using mutation hooks and rendering item stats.",
  "frontend/src/pages/KillersPage.tsx": "Lists all killers with unlock status and stats, and provides a button to unlock the next killer via a mutation.",
  "frontend/src/pages/ShopPage.tsx": "Renders the shop with purchasable items, including an expensive admin panel, and handles purchase actions with mutations.",
  "frontend/src/pages/SocialPage.tsx": "Implements the Social page with follow/unfollow, friend detection, username-to-principal resolution, and displaying followers, following, and friends.",
  "frontend/src/pages/SurvivorsPage.tsx": "Displays the user's survivors, allows creating new survivors with custom stats, and lets the user set an active survivor.",
  "frontend/src/pages/UpdatesPage.tsx": "Shows a list of static game update entries with version info, dates, descriptions, and feature lists.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project’s current game features, requirements, issues, and architectural notes using a structured state file."
}