{
  "backend/main.mo": "Defines core game data types, player profiles, combat structures, clan data, and initializes key maps for profiles, combat, clans, joins, and dungeons.",
  "feature_evidence.json": "Lists feature evidence entries referencing specific frontend files and required UI or logic updates for killers, bosses, and admin pet options.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend files, covering routing, UI components, gameplay pages, and new dungeon and clan systems.",
  "frontend/index.css": "Sets global Tailwind-based color variables and theme styles for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app through main.tsx.",
  "frontend/src/App.tsx": "Main app component handling authentication gate, profile setup, routing, and page rendering.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper that manages login/logout via Internet Identity and displays login UI when unauthenticated.",
  "frontend/src/components/GameLayout.tsx": "Layout wrapper providing header, navigation tabs, currency display, logout handling, and main content container.",
  "frontend/src/components/ProfileSetupDialog.tsx": "UI dialog that lets a user create a new player profile, calling useCreatePlayerProfile on button click.",
  "frontend/src/components/ProgressionPanel.tsx": "Displays a survivor’s level, experience progress, and core stats with icons and progress bars.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, and logout handling for the app.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks that call backend actor methods for profiles, survivors, equipment, and admin actions.",
  "frontend/src/index.css": "Tailwind base setup defining theme variables for light/dark modes and global styles.",
  "frontend/src/main.tsx": "App bootstrap that sets up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin UI allowing users with permissions to grant currency, manage killers, levels, weapons, and pets.",
  "frontend/src/pages/ClansPage.tsx": "Displays clans and join listings, allowing users to create listings, create clans from listings, or join existing or random clans.",
  "frontend/src/pages/DungeonPage.tsx": "Shows available dungeons and lets users start quests, complete them, and unlock crates while tracking rewards and progress.",
  "frontend/src/pages/GameplayPage.tsx": "Provides combat gameplay where users select enemies, start battles, perform attacks, and view combat logs and results.",
  "frontend/src/pages/HomePage.tsx": "Home hub displaying user stats and navigation cards for survivors, combat, inventory, killers, shop, and admin sections.",
  "frontend/src/pages/InventoryPage.tsx": "Displays the user's weapons and pets and allows equipping items with indicators for currently equipped gear.",
  "frontend/src/pages/KillersPage.tsx": "Displays the player's killers, their unlock status, stats, and provides a button to unlock the next killer.",
  "frontend/src/pages/ShopPage.tsx": "Shows shop items, especially the purchasable Admin Panel, and handles purchase logic with currency checks.",
  "frontend/src/pages/SurvivorsPage.tsx": "Manages creation, listing, and activation of survivors with a dialog for entering custom stats.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugin support.",
  "project_state.json": "Project metadata describing game features, versions, requirements, and current implemented functionality."
}