{
  "backend/main.mo": "Main Motoko actor defining all game entity types, core maps, and state holders for profiles, combat, clans, dungeons, bots, and social systems.",
  "backend/migration.mo": "Migration module defining legacy types and state structures used to upgrade stored data between versions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose and functionality.",
  "frontend/index.css": "Global Tailwind-based theme variables and dark-mode styling for the frontend.",
  "frontend/index.html": "Base HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Top-level React app managing authentication, routing between all pages, and profile setup flow.",
  "frontend/src/components/AuthGate.tsx": "Handles Internet Identity login flow, showing loading and login UI, and gates children until authenticated.",
  "frontend/src/components/GameLayout.tsx": "Provides the main game layout with navigation, header, footer, and logout handling based on user profile.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Displays a dialog for creating a new player profile with a single action button.",
  "frontend/src/components/ProgressionPanel.tsx": "Shows a survivor's level, experience progress, and core stats with icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the authenticated identity and invalidates dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, survivors, and game actions via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app, setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin tools page allowing currency grants, unlocking killers, setting levels, and managing weapons, pets, and events using multiple query mutations.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Displays all announcements and lets admins create new ones with title and message fields.",
  "frontend/src/pages/ClansPage.tsx": "Shows clan marketplace, join listings, and supports creating listings, forming clans, and joining clans or random ones.",
  "frontend/src/pages/DungeonPage.tsx": "Lists dungeons and quests, letting players start and complete quests and unlock crates with rewards.",
  "frontend/src/pages/GameplayPage.tsx": "Handles combat against preset enemies and bots, managing attacks, magic, and ongoing combat states.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing profile stats, survivor status, and navigation cards for gameplay sections.",
  "frontend/src/pages/InventoryPage.tsx": "Displays weapons and pets from the user profile with options to equip items.",
  "frontend/src/pages/KillersPage.tsx": "Shows killer progression, stats, and allows unlocking the next killer in sequence.",
  "frontend/src/pages/ShopPage.tsx": "Shop interface for purchasing items and the admin panel using in‑game currency.",
  "frontend/src/pages/SocialPage.tsx": "Social system for following, unfollowing, and viewing followers, following, and friends.",
  "frontend/src/pages/SurvivorsPage.tsx": "Displays the user's survivors, allows setting an active survivor, and provides a dialog form for creating new survivors with custom stats.",
  "frontend/src/pages/UpdatesPage.tsx": "Shows a static list of recent game updates with version info, dates, descriptions, and feature lists.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing them in sessionStorage, persisting them across navigation, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, animations, plugins, and content paths.",
  "project_state.json": "Defines the project’s current game concept, features, requirements, and architectural notes for development tracking."
}