{
  "kind": "build_request",
  "title": "Add an interactive 3D dungeon model to the Dungeons tab",
  "projectName": "Arcane Survival",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-66",
      "text": "Embed an interactive 3D dungeon scene into the Dungeons tab (`frontend/src/pages/DungeonPage.tsx`) above the existing dungeon/quest/crate lists, implemented with React Three Fiber, so authenticated users can rotate/zoom/pan the dungeon model.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make a 3d interactive 3d model of a dungeon at the dungeons tab."
        ]
      },
      "acceptanceCriteria": [
        "When visiting the Dungeons tab, a 3D viewport is visible above the existing dungeon content (quests/crates UI remains available below).",
        "The 3D dungeon view supports mouse/touch interaction: rotate and zoom at minimum (pan optional).",
        "If WebGL is unavailable or the scene fails to load, the page shows an English fallback message and the rest of the Dungeons UI still works."
      ]
    },
    {
      "id": "REQ-67",
      "text": "Add interactivity inside the 3D dungeon scene so the user can click at least two types of hotspots (Quest and Crate) and have the UI react by selecting/highlighting the matching quest or crate in the existing list UI for the currently displayed dungeon card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make a 3d interactive 3d model of a dungeon at the dungeons tab."
        ]
      },
      "acceptanceCriteria": [
        "The 3D scene renders visible hotspots/markers for quests and crates (visual differentiation such as color/shape).",
        "Clicking a Quest hotspot highlights the corresponding quest card in the list (e.g., with a border/outline) and scrolls it into view when possible.",
        "Clicking a Crate hotspot highlights the corresponding crate card in the list and scrolls it into view when possible.",
        "User-facing helper text is in English (e.g., “Click a marker to view the matching quest or crate”)."
      ]
    },
    {
      "id": "REQ-68",
      "text": "Add the required 3D asset(s) for the dungeon model as static frontend assets (no backend serving) and load them from the Dungeons page 3D scene.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make a 3d interactive 3d model of a dungeon at the dungeons tab."
        ]
      },
      "acceptanceCriteria": [
        "All 3D model assets are stored and loaded as static files from the frontend (not fetched from the backend canister).",
        "The 3D scene displays a dungeon-like model (not just a blank scene) and loads successfully in production build.",
        "A loading state is shown while the 3D asset is being loaded, using English text."
      ]
    },
    {
      "id": "REQ-69",
      "text": "Ensure the 3D dungeon viewer matches the existing game UI theme and layout conventions (card styling, spacing, dark fantasy/ember palette) without changing the existing navigation or backend APIs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make a 3d interactive 3d model of a dungeon at the dungeons tab."
        ]
      },
      "acceptanceCriteria": [
        "The 3D viewer is contained within the existing Dungeons page layout and does not visually clash with the current theme (dark background + ember primary).",
        "No changes are required to backend canister APIs for this feature."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not edit any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Backend must remain single-actor; this feature should not require backend changes.",
    "Do not serve 3D assets from the backend; treat them as static frontend assets."
  ],
  "nonGoals": [
    "Do not add multiplayer or real-time features (no WebSockets).",
    "Do not create a full 3D game loop or combat inside the 3D scene; the 3D model is a navigable/interactive viewer for the Dungeons tab.",
    "Do not introduce external 3D asset hosting/CDNs; keep assets within the frontend project."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}