{
  "kind": "build_request",
  "title": "Add Admin Panel Events tab and update Admin Panel purchase cost to 1,000,000,000",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Set the Admin Panel purchase cost to exactly 1,000,000,000 in-game currency in both the backend purchase logic and the Shop UI so the displayed price, affordability checks, and actual purchase enforcement all match.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create event tab where players who have admin panel have the feature create events on there admin panel and set admin panel cost to 1000000000 currency"
        ]
      },
      "acceptanceCriteria": [
        "In `backend/main.mo`, the Admin Panel cost used by `purchaseAdminPanel()` is 1_000_000_000 (not 10_000).",
        "In `frontend/src/pages/ShopPage.tsx`, the Admin Panel price display, affordability logic, and “need X more currency” message all use 1_000_000_000.",
        "Attempting to purchase the Admin Panel with currency < 1_000_000_000 fails with a clear error; purchasing with currency >= 1_000_000_000 succeeds and sets `hasAdminPanel = true`."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Implement an Admin Panel \"Events\" tab inside `frontend/src/pages/AdminPanelPage.tsx` that is only accessible to users who have purchased/unlocked the Admin Panel, and allow those users to create events from that tab using English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create event tab where players who have admin panel have the feature create events on there admin panel"
        ]
      },
      "acceptanceCriteria": [
        "The Admin Panel Tabs include a new tab labeled \"Events\".",
        "The Events tab provides a form to create an event (at minimum: event title and event description) and a submit button.",
        "After successful creation, the form clears and the UI shows the newly created event in a list on the same tab.",
        "All Events tab UI text is in English and follows existing styling and layout conventions used in AdminPanelPage (Cards, Labels, Inputs, Buttons, Tabs)."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Add backend support for Admin Panel Events: define a persisted event model and provide canister methods that allow an authenticated caller who has `hasAdminPanel = true` to create an event and list their created events; callers without the Admin Panel must be rejected with a clear error.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create event tab where players who have admin panel have the feature create events on there admin panel"
        ]
      },
      "acceptanceCriteria": [
        "`backend/main.mo` defines an Event type with fields sufficient to render an events list (at minimum: id, title, description, createdAt).",
        "A shared method exists to create an event for the caller and persists it so it remains after refresh/reload.",
        "A query method exists to list the caller’s events.",
        "If the caller is not authorized as a user, backend traps with an authorization error consistent with existing patterns.",
        "If the caller does not have `hasAdminPanel = true`, backend traps with a clear error message indicating the Admin Panel is required."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Extend the React Query data layer in `frontend/src/hooks/useQueries.ts` with hooks to call the new backend events methods (list events, create event), using the existing toast success/error pattern and appropriate cache invalidation so the Events tab stays in sync.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create event tab where players who have admin panel have the feature create events on there admin panel"
        ]
      },
      "acceptanceCriteria": [
        "A `useGetMyEvents` (or equivalent) query hook fetches the caller’s events and is used by the Events tab UI.",
        "A `useCreateEvent` (or equivalent) mutation hook creates an event and, on success, shows a success toast and refreshes the events list (via invalidation/refetch).",
        "On backend errors, the hooks show an error toast with the error message (matching the existing pattern used by other hooks in `useQueries.ts`)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Only create `backend/migration.mo` if a backward-incompatible state/schema change is required; prefer adding new state in a way that does not break existing profiles.",
    "Do not edit frontend files under `frontend/src/components/ui` or any other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not create a public, global in-game events feed visible to all players (only event creation and viewing for the creator is required).",
    "Do not implement real-time event updates or notifications.",
    "Do not add third-party integrations for scheduling, calendars, or messaging."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}