{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Usernames-first UI (profile setup + social) with principal as secondary",
  "requirements": [
    {
      "id": "REQ-62",
      "summary": "Collect username during profile setup and demote Principal ID to secondary/copy-only info",
      "acceptanceCriteria": [
        "The primary labeled field on the profile setup screen is `Username` (not `Your Principal ID`).",
        "The user can enter a username and submit profile creation; validation failures show clear English messages/toasts.",
        "Principal ID is not the primary identifier on this screen; it is optional/secondary and still copyable when the identity is available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Update the dialog UI to add a primary Username input (English label + helper text), submit using the updated create profile flow, and move Principal ID into a secondary/advanced section with the existing copy button. Ensure submit is disabled appropriately while identity is unavailable or mutation is pending. Use the selected \"authorization\" component guidance for user profile setup UX (avoid making principal the primary identifier). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-63",
      "summary": "Pass username through the create profile React Query flow and preserve toast + refetch behavior",
      "acceptanceCriteria": [
        "Creating a profile from the UI sends the username to the backend successfully.",
        "If the backend returns a username validation/uniqueness error, the user sees an English toast message and the button re-enables properly.",
        "On success, `['currentUserProfile']` is invalidated/refetched and the app transitions out of the profile setup flow as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update `useCreatePlayerProfile` to accept a `username` parameter and perform the updated backend flow (e.g., create profile then set username, or a single updated create call if the backend signature changes). Map backend username validation/uniqueness results (e.g., invalid length/characters, already taken, internal error) into clear English toasts, and keep the existing success toast and `['currentUserProfile']` invalidate/refetch pattern. Use the selected \"authorization\" component's frontend guidance for profile setup flow behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Switch Social page follow/unfollow input and lists to be username-first with principal fallback",
      "acceptanceCriteria": [
        "The Social page no longer asks for a 'Principal ID' as the primary input; it asks for a 'Username' with English helper text.",
        "Following/unfollowing works via username input (the app resolves username to principal via backend method(s) and then performs follow/unfollow using existing backend logic).",
        "Followers/Following/Friends lists display usernames when available; if a username cannot be resolved, the UI falls back to a shortened principal string.",
        "All user-facing messages on this page remain English (including validation errors)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query helpers needed by SocialPage for username-based social UX: (1) a mutation/query to resolve a Principal from a username (using the backend capability), (2) a query to resolve usernames for lists of principals (with caching; fall back when not found), and (3) optionally a wrapper mutation to follow/unfollow by username that composes resolve + existing follow/unfollow mutations. Ensure all surfaced errors are clear English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SocialPage.tsx",
          "operation": "modify",
          "description": "Replace Principal-ID input with a Username input and English helper text. On submit, resolve username -> principal via the backend capability and then follow/unfollow using the existing follow/unfollow logic. Update followers/following/friends list rendering to show resolved usernames as the primary line, with shortened principal as secondary detail/fallback. Keep validation and user-facing messages in English."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Replace other prominent 'Principal ID' identity displays with username-first UI while keeping principal accessible secondarily",
      "acceptanceCriteria": [
        "No primary, user-facing identity label in the app shows 'Principal ID' where 'Username' is intended as the main identifier.",
        "The app still functions with Internet Identity and principals internally; changes are limited to display and username-based lookup UX.",
        "Principal ID remains accessible where needed (secondary display/copy) and does not break existing flows."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GameLayout.tsx",
          "operation": "modify",
          "description": "Add a small username-first identity display in the header (e.g., show `profile.username` when available) to reinforce usernames as the primary identity, without exposing Principal ID as the main label. Keep any principal usage internal/secondary if added. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Ensure any remaining prominent references to 'Principal ID' are demoted to secondary/advanced copy-only context (labels and helper text remain English), aligning the overall identity presentation with username-first UX."
        }
      ]
    }
  ]
}