{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "AI Bot PvE, Expanded Shop Items, and Announcements Page",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Add AI bot PvE option in the Combat Arena UI using existing combat flow patterns and React Query/toast conventions.",
      "acceptanceCriteria": [
        "Backend exposes a query to list AI bots (id, name, and combat stats/rewards) for the frontend to display.",
        "Backend exposes a method to start a bot fight and returns the same kind of combat details used by the current combat UI (so existing battle rendering can be reused).",
        "Bot fights use the same eligibility requirements as existing combat (authenticated user with an active survivor).",
        "Winning a bot fight grants currency/EXP rewards to the caller and persists them in the caller’s profile.",
        "Frontend adds a new section/tab in the Combat Arena UI to browse AI bots and start a bot fight.",
        "Frontend uses React Query hooks and the existing toast success/error pattern for bot listing and bot fight actions, and invalidates/refetches currentUserProfile after fights that change rewards."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for bot PvE: list bots, start bot combat, fetch current bot combat status, and perform bot attacks. Use the existing toast success/error pattern and invalidate/refetch ['currentUserProfile'] after fight completion rewards. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GameplayPage.tsx",
          "operation": "modify",
          "description": "Extend Combat Arena UI to include a new tab/section for AI Bots: render the bot list, allow starting a bot fight, and run bot attacks using the same combat rendering area/pattern as current fights. Ensure eligibility messaging remains English and requires an active survivor. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Expand Shop page to display additional purchasable items and enable purchases with in-game currency while keeping the Admin Panel card unchanged.",
      "acceptanceCriteria": [
        "Backend provides a query to list shop items (stable ids, English name/description, price, and a clear item type/effect).",
        "Backend provides a purchase method that validates the caller has a profile and sufficient currency, subtracts currency, and grants the item effect to the caller (e.g., adds to inventory/collectedKeys/weapons/pets as appropriate).",
        "Shop purchases are persisted in the caller’s profile and are reflected on next profile fetch.",
        "Frontend Shop page shows the Admin Panel card unchanged (still costs 1,000,000,000) and additionally renders the new shop items with price, affordability state, and a purchase button.",
        "On successful purchase, the UI shows a success toast and refreshes the cached currentUserProfile; on failure, it shows the backend error via the existing toast pattern."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks to fetch shop items and purchase a shop item. Ensure success shows a success toast and invalidates/refetches ['currentUserProfile']; failures display backend errors via the existing toast pattern. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ShopPage.tsx",
          "operation": "modify",
          "description": "Update Shop UI to keep the existing Admin Panel card unchanged and add a new section that lists backend-provided shop items with name/description/price, an affordability state based on current currency, and a purchase button wired to the new purchase hook. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Add an Announcements page reachable from main navigation for authenticated users and render a scrollable list of announcements in English.",
      "acceptanceCriteria": [
        "A new page component (e.g., `AnnouncementsPage.tsx`) exists and renders a scrollable list of announcement entries using the existing UI card components styling pattern.",
        "The app-level page union/routing state in `frontend/src/App.tsx` is extended to include the new announcements page id and renders the new page when selected.",
        "`frontend/src/components/GameLayout.tsx` navigation includes a new \"Announcements\" item that navigates to the announcements page for authenticated users.",
        "Any user-facing text on the Announcements page is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AnnouncementsPage.tsx",
          "operation": "create",
          "description": "Create Announcements page that displays a scrollable list of announcement cards (title, date, body text) using existing UI components and English copy. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Extend the App-level Page union/state to include an 'announcements' page id and render AnnouncementsPage when selected (wiring it into the existing in-app navigation flow). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/GameLayout.tsx",
          "operation": "modify",
          "description": "Add an 'Announcements' navigation item (authenticated in-app navigation) that routes to the new announcements page id, following the existing navigation item pattern and keeping English labels. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Wire announcements list + admin-only creation UI using React Query hooks with toast pattern and cache invalidation.",
      "acceptanceCriteria": [
        "Backend defines an Announcement model (id, title, body, timestamp) and stores announcements persistently.",
        "Backend exposes a public query method to list announcements for authenticated users.",
        "Backend exposes a create announcement method restricted to callers who have `hasAdminPanel = true`, rejecting others with a clear error message.",
        "Frontend adds React Query hooks in `frontend/src/hooks/useQueries.ts` to list announcements and create an announcement using the existing toast success/error pattern and appropriate cache invalidation.",
        "Frontend adds an Announcements creation UI for Admin Panel owners (either as a new Admin Panel tab or a clearly marked admin-only section) that submits title/body and then refreshes the announcements list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for announcements: list announcements and create announcement. Use the existing toast success/error pattern; on create success invalidate/refetch the announcements list query; on failure show backend error. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AnnouncementsPage.tsx",
          "operation": "modify",
          "description": "Add an admin-only announcement creation section visible only when currentUserProfile.hasAdminPanel is true, with title/body inputs and a submit button wired to the create announcement hook; refresh the list via query invalidation and keep all UI copy in English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Update local frontend Page unions/types to include the new Announcements page and avoid TypeScript errors as navigation expands.",
      "acceptanceCriteria": [
        "The frontend TypeScript build succeeds with no Page-union type errors after adding the new Announcements page and any new combat/shop navigation.",
        "Home page navigation callbacks remain functional and type-safe after the page set expands."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the local Page type union used by HomePage navigation callbacks to remain compatible with the expanded app navigation (including announcements and other existing pages) and prevent TypeScript type errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/GameLayout.tsx",
          "operation": "modify",
          "description": "Keep the GameLayout Page type union aligned with App-level navigation (including announcements) to avoid TypeScript mismatch across navigation helpers. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the App-level Page union is the single source for page ids (including announcements) and that all page render branches remain type-safe. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}