{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-16T15:54:33.502Z",
  "summary": "Diff implements username UI in profile setup and social page, adds a `username` field to the backend `PlayerProfile`, introduces a `usernames` index map, and wires in a migration hook. However, the diff summary does not provide enough evidence that backend username validation/uniqueness enforcement, username resolution query methods, or deterministic default-username migration behavior are fully implemented. Some unrelated UI/navigation changes (e.g., Aura page/nav) also appear.",
  "missing_requirements": [
    {
      "id": "REQ-58",
      "requirement": "Enforce that usernames are unique across all players and reject creating/updating a username if already taken, returning a clear English error message.",
      "reason": "The diff shows a new `usernames` map and a `username` field, but does not show any backend logic that checks the index and rejects duplicates with an English error message.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-59",
      "requirement": "Require a username at profile creation time (or via a dedicated username-setting method invoked immediately after creation) with validation (empty/invalid chars/length/already taken) and clear English errors.",
      "reason": "Frontend uses a two-step flow (create profile then set username), but the diff summary does not include the backend `setUsername` implementation nor any shown validation rules/error strings. Frontend-side hints are not sufficient to prove backend enforcement.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/components/ProfileSetupDialog.tsx",
        "frontend/src/hooks/useQueries.ts"
      ]
    },
    {
      "id": "REQ-60",
      "requirement": "Expose backend query method(s) to resolve username for principal(s) and resolve principal by username, with English not-found/errors.",
      "reason": "Frontend adds hooks that call `getPrincipalForUsername` and batch username resolution, but the backend diff snippet does not show these query methods or their error behavior.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/pages/SocialPage.tsx",
        "frontend/src/hooks/useQueries.ts"
      ]
    },
    {
      "id": "REQ-61",
      "requirement": "If needed, add a conditional migration that assigns deterministic default usernames for existing profiles and builds any needed username index without trapping on upgrade.",
      "reason": "A migration hook and `backend/migration.mo` are added, but the diff content shown is truncated and does not evidence assigning deterministic unique default usernames or rebuilding the username index for existing profiles.",
      "evidence": [
        "backend/main.mo",
        "backend/migration.mo"
      ]
    },
    {
      "id": "REQ-65",
      "requirement": "Update other prominent UI surfaces that present 'Principal ID' as the player identity to display username instead, keeping Principal ID secondary where appropriate.",
      "reason": "Only `GameLayout` header badge and the profile setup/social page changes are evidenced. The diff summary does not demonstrate updates across other prominent identity surfaces (e.g., other headers/cards/profile summaries) beyond those files.",
      "evidence": [
        "frontend/src/components/GameLayout.tsx",
        "frontend-file-summaries.txt"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added/featured an 'Aura' page/navigation item and related UI/icon usage.",
      "reason": "Aura-related navigation and page-type union are not part of the username/principal-display BuildRequest requirements.",
      "evidence": [
        "frontend/src/components/GameLayout.tsx",
        "frontend-file-summaries.txt"
      ]
    },
    {
      "description": "Large unrelated gameplay/UI feature descriptions (killers unlock list changes, dungeon features, etc.) included in the frontend summaries file.",
      "reason": "These features are not requested by the BuildRequest (which is scoped to username/principal display and lookup). The only direct evidence is the documentation/summary content, not necessarily code changes, but it is still an unrequested addition in the diff.",
      "evidence": [
        "frontend-file-summaries.txt"
      ]
    }
  ],
  "confidence": 0.66,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/GameLayout.tsx",
    "frontend/src/components/ProfileSetupDialog.tsx",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/SocialPage.tsx",
    "project_state.json"
  ]
}